docs/zig.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>zig</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org5ad672e">
<div class="navbar-brand" id="org072a959">
<div class="navbar-item" id="org577fb97">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="orgd6fd546">
<div class="navbar-start" id="orgcc87a99">
<div class="navbar-item" id="orgd5d40ed">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org6ad83c6">

</div>

</div>
</nav>
<div id="outline-container-org0d94926" class="outline-2">
<h2 id="org0d94926">zig</h2>
<div class="outline-text-2" id="text-org0d94926">
</div>
<div id="outline-container-orgee7c46a" class="outline-3">
<h3 id="orgee7c46a">Using linked C libraries</h3>
<div class="outline-text-3" id="text-orgee7c46a">
<div class="org-src-container">
<pre class="src src-zig" id="org6cf75c3">const std = @import("std");

pub fn build(b: *std.build.Builder) !void {
    const target = b.standardTargetOptions(.{});
    const mode = b.standardReleaseOptions();
    const exe = b.addExecutable("zgl", "src/main.zig");
    //exe.is_dynamic = false;
    exe.setTarget(target);
    exe.setBuildMode(mode);
    exe.linkLibC();
    exe.addIncludeDir("/gnu/store/6l9rix46ydxyldf74dvpgr60rf5ily0c-guile-3.0.7/include/guile/3.0/");
    exe.addLibPath("/gnu/store/6l9rix46ydxyldf74dvpgr60rf5ily0c-guile-3.0.7/lib");
    exe.addPackagePath("guile-3.0", "/gnu/store/6l9rix46ydxyldf74dvpgr60rf5ily0c-guile-3.0.7/lib/pkgconfig/guile-3.0.pc");
    exe.linkSystemLibrary("guile-3.0");
    exe.install();
    const run_cmd = exe.run();
    run_cmd.step.dependOn(b.getInstallStep());
    if (b.args) |args| {
        run_cmd.addArgs(args);
    }
    const run_step = b.step("run", "run the app");
    run_step.dependOn(&amp;run_cmd.step);
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-zig" id="org646cfb2">const std = @import("std");

const c = @cImport({
    @cInclude("libguile.h");
});

pub fn main() anyerror!void {
    std.log.info("starting", .{});
    c.scm_init_guile();
    std.log.info("loaded guile", .{});
//    var prog_flag = [_]u8{ 'z', 'g', 'l', 0 };
    var prog_flag = "zgl";
//    var ex_flag = [_]u8{ '-', 'v', 0 };
    var args = [_][*c]u8{
        &amp;prog_flag,
//        &amp;ex_flag,
    };
    std.log.info("loading shell", .{});
    c.scm_shell(args.len, &amp;args);
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-zig" id="orgf9908e5">const std = @import("std");

const c = @cImport({
    @cDefine("JULIA_DEFINE_FAST_TLS()", {});
    @cInclude("julia.h");
});

pub fn main() anyerror!void {
    std.log.info("starting", .{});
    c.jl_init();
    std.log.info("loaded julia", .{});
    _ = c.jl_eval_string("print(sqrt(2.0))");
    c.jl_atexit_hook(0);
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-zig" id="orgbbffd0c">const std = @import("std");

pub fn build(b: *std.build.Builder) void {
    const target = b.standardTargetOptions(.{});
    const mode = b.standardReleaseOptions();
    const exe = b.addExecutable("zjl", "src/main.zig");
    exe.setTarget(target);
    exe.setBuildMode(mode);
    exe.addIncludeDir("/usr/include/julia");
    exe.addLibPath("/usr/lib/julia");
    exe.linkLibC();
    exe.linkSystemLibrary("julia");
    exe.linkSystemLibrary("openlibm");
    exe.install();
    const run_cmd = exe.run();
    run_cmd.step.dependOn(b.getInstallStep());
    if (b.args) |args| {
        run_cmd.addArgs(args);
    }
    const run_step = b.step("run", "run the app");
    run_step.dependOn(&amp;run_cmd.step);
}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>